rails_bigfoot_api--api/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
---
    def index
      @posts = Post.all
      @fullPosts = @posts.map { | post | {
        post: post,
        comments: Comment.where(:post_id => post.id)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]
---
     def show
       begin
         @post = Post.find(params[:id])

INSERT INTO "posts" ("post", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post", "dfg"], ["created_at", "2019-06-05 20:59:56.959337"], ["updated_at", "2019-06-05 20:59:56.959337"], ["user_id", 1]]
---
       def create
       @post = Post.new(post_params)

        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
UPDATE "posts" SET "post" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["post", "hello"], ["updated_at", "2019-06-06 16:08:12.707330"], ["id", 51]]
---
      def update
        @post = Post.find(params[:id])
        @post.update post_params

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]
---
       def destroy
        @post = Post.find(params[:id])
        @post.destroy()