rails_bigfoot_api--api/app/controllers/sightings_controller.rb

SELECT "sightings".* FROM "sightings"
---
    def index
      @sightings = Sighting.all

SELECT  "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
     def show
       begin
         @sighting = Sighting.find(params[:id])